Awis13/seed/seeds/esp32-tembed/src/ui.h
/* TV-B-Gone. The three blasts are the three regions POST /ir/tvbgone takes;
   By brand opens the named codes. */
enum {
    UI_TV_ALL = 0,
    UI_TV_NA,
    UI_TV_EU,
    UI_TV_BRAND,
    UI_TV_BACK,
    UI_TV_COUNT
};

static const char *ui_tv_items[UI_TV_COUNT] = {
    "Blast all",
    "Blast NA",
    "Blast EU",
    "By brand >",
    "Back"
};

static uint8_t ui_screen = UI_CLOCK;
static int ui_sel = 0;
static int ui_sel_drawn = -1;
/* First list entry on screen: the by-brand list is longer than the panel. */
static int ui_first = 0;
static unsigned long ui_last_input = 0;
static unsigned long ui_last_draw = 0;
/* When the blast being watched stopped running, 0 while it still is. */
static unsigned long ui_blast_done_at = 0;
/* The same, for the recording screen: when the take ended, 0 while it runs. */
static unsigned long ui_rec_done_at = 0;
/* False when the menu could not start a blast and none was already running. */
static bool ui_blast_ok = true;
/* The list the blast was started from, so that finishing goes back to it. */
static uint8_t ui_blast_back = UI_TVMENU;
static int ui_blast_back_sel = 0;

/* Which notification the card is showing. An id, not an index: the list can
   shift underneath it when something expires or a new message arrives. */
static uint32_t ui_msg_id = 0;
/* Fade frames already drawn for the card in front, MSG_FADE_STEPS once done. */
static uint8_t ui_card_fade = 0;
/* Which reply chip the knob is on, for the card in front. Its own variable and
   deliberately not ui_sel: ui_sel is the row in the message list this card was
   opened from, and the card hands it straight back on the way out — a second
   meaning on it would move the list under the user. Meaningless on a message
   that carries no options, which is every message that never gets here. */
static int ui_chip_sel = 0;
/* Scroll window the message list was last drawn with, so that a window that
   moved is recognised as needing the same full repaint a moved selection does. */
static int ui_first_drawn = -1;

#define UI_MENU_Y0   30
#define UI_MENU_DY   32
/* Rows of font 4 at that pitch that fit above the bottom of a 170px panel. */
#define UI_MENU_ROWS 4
#define UI_ROW_COUNT 8

/*
 * Message list geometry. Font 2 rows on a rigid three-column grid, five of
 * them under an 18px header bar: bars at y-4 for 24px, pitch 28, so the last
 * one ends at 156 on a 170px panel.
 *
 * Every column width below is a budget the renderer ellipsises into, and each
 * was checked against TFT_eSPI's own width tables rather than by eye. In font
 * 2 the widest glyph is 10px ('M' and 'W'), so the guaranteed worst case is 7
 * characters of source, 16 of title and 4 of age — and the measured strings
 * that actually appear are well inside that: "! HOME-RIG" is 69px of the 76
 * the source column has, and the longest age "59m" is 24px of 46.
 */
#define MSG_ROWS      5
#define MSG_ROW_Y0    24
#define MSG_ROW_DY    28
#define MSG_BAR_X      6
#define MSG_BAR_W    308
#define MSG_BAR_UP     4   /* bar top, above the row's text origin */
#define MSG_BAR_H     24
#define MSG_SRC_X     10
#define MSG_SRC_W     76
#define MSG_TITLE_X   92
#define MSG_TITLE_W  160
#define MSG_AGE_R    310   /* right-aligned to this edge */
#define MSG_AGE_W     46

/*
 * Card geometry. 300x100 at (8,28), leaving the header bar above and a hint
 * line below at 140. Text is inset 14px from the left so it clears the 3px
 * accent bar, and 10px from the right, which gives the title 276px — 11
 * characters at the widest glyph font 4 has, and around 18 of ordinary mixed
 * case. The body gets the same 276px, 27 characters worst case in font 2 and
 * around 34 in practice, over as many lines as the band below the title holds.
 */
/* The numbers below are compiled verbatim on the host by tools/test_card.sh,
   which is what turns the line counts into arithmetic something checks. Keep
   every marker line self-closed and on a line of its own, and keep every
   comment inside the region fully closed: the slicer copies from the marker
   without understanding what it copies. */
/* host-test:begin cardgeom — sliced out by tools/test_card.sh */
#define MSG_CARD_X     8
#define MSG_CARD_Y    28
#define MSG_CARD_W   300
#define MSG_CARD_H   100
#define MSG_PAD_L     14
#define MSG_PAD_R     10
#define MSG_ACCENT_W   3
/* Offset of each card peeking out behind. Named MSG_CARD_PEEK rather than the
   obvious MSG_PEEK because lwIP's <sys/socket.h> already owns that name — it
   arrived in this translation unit the day skills/voice.cpp started including
   esp_http_client.h, and the firmware is one translation unit, so a UI layout
   constant and a socket recv() flag were suddenly the same macro. */
#define MSG_CARD_PEEK  3
#define MSG_HINT_Y   140
/* The band under the card is one padded field the width of the card itself.
   The padding is the erase: TFT_eSPI back-fills it with the background, so a
   string that changes length — and the chip row changes length whenever it is
   answered — leaves nothing of the previous one behind. Narrowing this is what
   would produce ghosting, so it is a budget the chip row is fitted into rather
   than a number to tune. Written as the card's width and not as the number that
   happens to be: this region exists so that these stop being literals. */
#define MSG_HINT_W   MSG_CARD_W

/*
 * The card's own rows, as offsets from its top edge.
 *
 * These were bare literals inside ui_draw_card() — y + 7, y + 28, y + 60,
 * y + 78 — which made the one number this screen turns on, how many lines of
 * body a reader gets, something no test could reach and no reader could check
 * without a ruler. They are named here so the count below is arithmetic
 * instead of a claim in a comment.
 *
 * MSG_LINE_H is chr_hgt_f16 from TFT_eSPI's Fonts/Font16.h, which is what
 * fontHeight(2) returns and what setTextPadding erases: the pitch is two
 * pixels more than that, so there is a 2px band between lines that no field's
 * padding ever covers. That band is why the scroll position is a line index
 * and never a pixel offset — see ui_card_line[].
 */
#define MSG_HDR_DY      7   /* source and age */
#define MSG_TITLE_DY   28   /* the title, font 4, 26px tall */
#define MSG_BODY_DY    60   /* first body line, under a title */
#define MSG_BODY_DY_TOP 25  /* first body line when the title is not drawn */
#define MSG_BODY_PITCH 18
#define MSG_LINE_H     16   /* chr_hgt_f16 */
/* The last row inside the card: the border occupies MSG_CARD_H - 1. */
#define MSG_BODY_BOTTOM (MSG_CARD_H - 2)
#define MSG_BODY_W      (MSG_CARD_W - MSG_PAD_L - MSG_PAD_R)

/* Whole lines of MSG_LINE_H at MSG_BODY_PITCH that fit between `dy` and the
   bottom of the card. */
#define MSG_BODY_FIT(dy) \
    ((MSG_BODY_BOTTOM - (dy) + 1 - MSG_LINE_H) / MSG_BODY_PITCH + 1)
/* Two with the title, four without it. The title is what the fourth and third
   lines cost, and ui_draw_card() spends it only on a body that needs them. */
#define MSG_BODY_ROWS     MSG_BODY_FIT(MSG_BODY_DY)
#define MSG_BODY_ROWS_MAX MSG_BODY_FIT(MSG_BODY_DY_TOP)
static_assert(MSG_BODY_ROWS == 2,
              "the short band is no longer two lines — the title rule below "
              "and the tests that pin it are stated in twos");
static_assert(MSG_BODY_ROWS_MAX == 4,
              "the full band is no longer four lines");
static_assert(MSG_BODY_ROWS_MAX > MSG_BODY_ROWS,
              "hiding the title buys no lines, so there is nothing to spend it on");
static_assert(MSG_BODY_DY_TOP >= MSG_HDR_DY + MSG_LINE_H,
              "the first body line would be drawn over the source and age row");

/* Font 2's extreme glyph widths, from TFT_eSPI's Fonts/Font16.c: 3px is the
   punctuation ('!', an apostrophe, a comma, a colon, a semicolon, a bar) and
   10px is 'M' and 'W'. Both are read back out of that table by
   tools/test_card.sh rather than trusted here, because both are load-bearing:
   the narrow one sizes the line cache and the wide one bounds the line count. */
#define MSG_GLYPH_W_MIN 3
#define MSG_GLYPH_W_MAX 10

