Awis13/seed/seeds/esp32-tembed/src/ui.h
/*
 * The most lines a body can wrap into, which is what ui_card_line[] is sized
 * for rather than a number chosen to look safe.
 *
 * A line ends either on a space or, for a word wider than the whole line, on
 * the last character that fits — so a line costs at least two bytes ("a ") and
 * a line that cheap forces the next one to be expensive: the space that made it
 * cheap was the LAST one inside the fitting prefix, so the following
 * MSG_BODY_W / MSG_GLYPH_W_MAX - 2 characters carry no space at all and the
 * next line must swallow them. Two consecutive lines therefore cost at least
 * one fitting prefix between them, and the worst case is bounded by two lines
 * per prefix, plus one for the remainder. tools/test_card.sh measures the real
 * worst case against this bound rather than restating it.
 */
#define MSG_BODY_FIT_MIN   (MSG_BODY_W / MSG_GLYPH_W_MAX)
#define MSG_BODY_MAX_LINES (2 * (NOTIFY_BODY_LEN / MSG_BODY_FIT_MIN + 1) + 1)

/* Where the scrollbar goes: one pixel at the card's inner right edge, running
   the height of the body band. Meshtastic puts its thumb at width - 2 of the
   screen it owns; the card is what this owns, so the same two pixels are
   measured off its own right edge instead. */
#define MSG_SCROLL_DX (MSG_CARD_W - 2)
#define MSG_SCROLL_MIN_H 6

/* One drawn body line, as bytes: a full line of the narrowest glyph, plus the
   terminator. It is the pixel budget that decides how much of a body a line
   carries, so it is the pixel budget that sizes the buffer. */
#define MSG_LINE_LEN (MSG_BODY_W / MSG_GLYPH_W_MIN + 1)
/* host-test:end */

/* Arrival: three frames of rising blend plus a few pixels of upward travel.
   40ms a frame, so the whole thing is over in 120ms — present enough to read
   as an arrival, short enough that it never delays the first look. */
#define MSG_FADE_STEPS 3
#define MSG_FADE_MS   40
#define MSG_TINT_A    26   /* card fill: level colour at ~10% over black */
#define MSG_BORDER_A 102   /* card border: the same colour at ~40% */

/* One cache line per drawn row, shared by every screen in this file: only one
   of them is on screen at a time, and entering any screen wipes the panel and
   raises display_force, which makes draw_field ignore whatever the previous
   screen left in here. Wide enough for an ellipsised font 4 title, which is
   the longest string any of them draws — so it is keyed to the title field and
   not to a number, because draw_field compares only the first cache_size - 1
   bytes: a line narrower than what it is asked to hold makes two different
   titles agreeing on that prefix compare equal, and the card then keeps the
   previous message's title on screen. */
#define UI_ROW_LEN   (NOTIFY_TITLE_LEN + 4)
static char ui_row[UI_ROW_COUNT][UI_ROW_LEN];
/* Says the same thing to a reader who pins this back to a number: the four
   bytes are the ellipsis and its terminator, and a line short of that is a
   cache that cannot hold what the widest column draws through it. */
static_assert(sizeof(ui_row[0]) >= NOTIFY_TITLE_LEN + 4,
              "a row cache line is narrower than an ellipsised title");

/* The message list needs its own cache: three cells per row, and it is the one
   screen whose rows are not a single string. Each cell is wide enough for the
   longest string its column can ever be asked to draw — an ellipsised title —
   so that the cache always holds the whole of what is on the panel and two
   different rows can never compare equal.
   Which is the same width, and the same reason, as a row cache line, so it is
   defined from it rather than spelled out again: two names for one expression
   are two places to change and one of them gets missed. */
#define MSG_CELL_LEN UI_ROW_LEN
static char ui_msg_cell[MSG_ROWS][3][MSG_CELL_LEN];

/* The card's body lines get their own cache, one line per drawn row and each
   wide enough for the widest thing a row can hold: MSG_BODY_W pixels of the
   narrowest glyph font 2 has, plus the terminator. Sized to the pixels rather
   than to the body, because it is the pixels that decide how much of the body
   a line carries — and it must not be sized to ui_row[], which is
   UI_ROW_LEN = 69: draw_field compares only cache_size - 1 bytes, so two
   different lines of narrow glyphs agreeing on the first 68 would compare
   equal and the repaint would be skipped, leaving the previous scroll
   position's text on the panel. */
static char ui_card_body[MSG_BODY_ROWS_MAX][MSG_LINE_LEN];
static_assert(MSG_LINE_LEN > MSG_BODY_W / MSG_GLYPH_W_MIN,
              "a body cache line cannot hold a full line of the narrowest glyph");
static_assert(MSG_LINE_LEN > UI_ROW_LEN,
              "a body line is no wider than a row line — check MSG_BODY_W and "
              "the font table before making them share a cache");

/* The body itself is not cached as text: it is wrapped once into byte offsets
   into the message, and copied out one line at a time as it is drawn. Offsets
   rather than copies because a 256-byte body can wrap into MSG_BODY_MAX_LINES
   lines, and that many line-sized buffers would be several kilobytes on a
   device with 320 of them. See ui_wrap_lines() and ui_card_line[]. */

static void ui_draw_row(int i, const char *text, int32_t y, uint8_t font,
                        uint16_t color) {
    draw_field(ui_row[i], sizeof(ui_row[i]), text, 12, y, font, color,
               TL_DATUM, 296);
}

/* ===== Fitting text to a column =====
 *
 * Columns are pixel budgets, and what goes in them is whatever an agent put in
 * the JSON. Everything below measures with TFT_eSPI's own tables — the same
 * ones textWidth() reads — so a string is cut where it actually stops fitting
 * rather than at a character count guessed from an average glyph.
 *
 * The fitting helpers and the chip row further down are compiled verbatim on
 * the host by tools/test_chips.sh. Keep every marker line self-closed and on a
 * line of its own, and keep every comment inside a marked region fully closed:
 * the slicer copies from the marker without understanding what it copies.
 */

/* host-test:begin fit — sliced out by tools/test_chips.sh */
static int ui_char_w(char c, uint8_t font) {
    char s[2] = {c, '\0'};
    return tft.textWidth(s, font);
}

/* Copy `src` into `dst`, cut to `max_px` with a trailing ellipsis if it does
   not fit. A column too narrow for the ellipsis itself is hard-truncated
   instead — three dots and nothing else says less than two real characters. */
static void ui_ellipsis(char *dst, size_t n, const char *src, uint8_t font,
                        int max_px) {
    if (n == 0) return;
    dst[0] = '\0';
    if (!src) return;
    if (tft.textWidth(src, font) <= max_px) {
        /* Copied a character at a time rather than with snprintf("%s"): the
           destination is a cache line sized for the widest thing this column
           can display, and spelling the bound out here is what keeps it from
           becoming a second, silent limit the compiler has to warn about. */
        size_t i = 0;
        while (src[i] && i + 1 < n) { dst[i] = src[i]; i++; }
        dst[i] = '\0';
        return;
    }

    int ell = tft.textWidth("...", font);
    bool with_ellipsis = (ell < max_px);
    int budget = with_ellipsis ? max_px - ell : max_px;

    size_t out = 0;
    int acc = 0;
    for (const char *p = src; *p && out + 4 < n; p++) {
        int cw = ui_char_w(*p, font);
        if (acc + cw > budget) break;
        acc += cw;
        dst[out++] = *p;
    }
    /* Hang the ellipsis off a word rather than off a gap. */
    while (out > 0 && dst[out - 1] == ' ') out--;
    dst[out] = '\0';
    if (with_ellipsis) snprintf(dst + out, n - out, "...");
}
/* host-test:end */

/* ===== Wrapping the body over lines =====
 *
 * This replaces a two-line wrap that put an ellipsis on its second line to say
 * "it stops here". It stops nowhere now: the card scrolls, and the scrollbar
 * says where in the body a reader is far better than three dots ever did.
 * ui_ellipsis() is still what cuts the title, the list cells and the chips,
 * which are columns with no second line to continue onto.
 */
/* host-test:begin wrap — sliced out by tools/test_card.sh */
/* One wrapped line, as a place in the body rather than a copy of it. */
struct UiLine {
    uint16_t start;
    uint16_t len;
};

