Awis13/seed/seeds/esp32-tembed/src/ui.h
/*
 * Break `src` into lines of at most `max_px`, on a space where there is one,
 * and record where each line begins and how long it is. Returns the number of
 * lines, which is never more than `max_lines`.
 *
 * Called once when a card opens, not once a frame: the body of a stored
 * message does not change while it is being read, and re-measuring 256
 * characters against the font table at UI_TICK_MS would be work nothing asked
 * for. The scroll position then moves a line index over the result.
 *
 * A line never starts on a space — the gap a break was taken at belongs to
 * neither side — so no line is empty and no line is blank, which is what lets
 * the drawing below tell "this row has nothing on it" from "this row has text
 * that happens to be spaces".
 *
 * A word wider than the whole line has no space to break on and is cut, the
 * way the same case has always been cut here. `take` is floored at one
 * character so that a line always consumes something: a glyph wider than
 * `max_px` would otherwise consume nothing and this would not terminate.
 */
static int ui_wrap_lines(const char *src, UiLine *out, int max_lines,
                         uint8_t font, int max_px) {
    if (!src || !out || max_lines <= 0) return 0;

    int n = 0;
    size_t p = 0;
    while (n < max_lines) {
        while (src[p] == ' ') p++;
        if (!src[p]) break;

        int acc = 0, last_space = -1;
        size_t i = p;
        for (; src[i]; i++) {
            /* A gap is noted before it is measured, so the gap the line runs
               out ON is still a place to break. Measuring first loses the last
               word of a line that fills the band exactly: the space after it
               does not fit, and the break falls back to the space before it. */
            if (src[i] == ' ') last_space = (int)(i - p);
            int cw = ui_char_w(src[i], font);
            if (acc + cw > max_px) break;
            acc += cw;
        }

        size_t take;
        if (!src[i])             take = i - p;              /* the rest fits */
        else if (last_space > 0) take = (size_t)last_space;
        else                     take = i - p;              /* one long word */
        if (take == 0) take = 1;

        out[n].start = (uint16_t)p;
        out[n].len   = (uint16_t)take;
        n++;
        p += take;
    }
    return n;
}

/* Copy one line out of the body it was measured in. */
static void ui_line_text(char *dst, size_t n, const char *src, UiLine ln) {
    if (!dst || n == 0) return;
    dst[0] = '\0';
    if (!src) return;
    size_t take = ln.len;
    if (take > n - 1) take = n - 1;
    memcpy(dst, src + ln.start, take);
    dst[take] = '\0';
}

/*
 * Force the next draw of a cached field, without display_force.
 *
 * A scroll step changes what every body row says, and the obvious way to make
 * draw_field notice is display_force — which on this screen is the second half
 * of `if (fading || display_force)` and would re-erase the whole 306x112
 * envelope, redraw the stack outlines, the tint, the border and the accent bar.
 * That is a visible flash on every detent, for the two or four lines of body
 * text a step actually changes.
 *
 * So the cache is poisoned instead. Emptying it is not enough: draw_field
 * compares the cache against the new text, and a row that has nothing to show
 * would be handed "" and match an emptied cache exactly, leaving the previous
 * line on the panel. The poison is a byte notify_copy_text() replaces with a
 * space in everything it stores, so no line drawn here can ever equal it —
 * including the empty one.
 */
#define UI_CACHE_POISON '\x01'
static_assert(UI_CACHE_POISON < 0x20,
              "the cache poison is a byte a stored message can contain");
static void ui_cache_drop(char *cache) {
    cache[0] = UI_CACHE_POISON;
    cache[1] = '\0';
}
/* host-test:end */

/* The wrapped body and where the reader is in it. Below the region above
   because they are typed by it. */
static UiLine ui_card_line[MSG_BODY_MAX_LINES];
static int ui_card_lines = 0;         /* lines the body wrapped into */
static uint32_t ui_card_wrapped = 0;  /* the id ui_card_line[] describes */
static int ui_card_first = 0;         /* first visible line */
/* Scroll position the body rows were last drawn at, so that a moved one is
   recognised — the same shape as ui_first_drawn on the message list. */
static int ui_card_first_drawn = -1;
/* Whether the title is drawn, decided once with the wrap: a body that fits the
   short band keeps its title, a longer one spends it on two more lines. */
static bool ui_card_titled = true;
/* Thumb the scrollbar currently has on the panel, so a pass that changes
   nothing costs no SPI — the same rule every text field here follows, kept by
   hand because the bar is pixels rather than a string. -1 is "the band is bare
   card", which is also what a repaint of the card leaves behind. */
static int ui_card_thumb_y = -1;
static int ui_card_thumb_h = -1;
/* A press that was still down when the card it began on went away — the message
   expired or was evicted mid-hold. Its release is still to come, and on the list
   the card dropped to it would read as a plain step up: one gesture, two levels
   out. This is what ui_poll() discards it by. Set only while the key is down and
   cleared by the very release it was set for. */
static bool ui_drop_user_click = false;

/* Service text is capitals. Sources arrive as whatever an agent typed. */
/* host-test:begin fit — sliced out by tools/test_chips.sh */
static void ui_caps(char *dst, size_t n, const char *src) {
    size_t i = 0;
    for (; src && src[i] && i + 1 < n; i++) {
        char c = src[i];
        dst[i] = (c >= 'a' && c <= 'z') ? (char)(c - 'a' + 'A') : c;
    }
    dst[i] = '\0';
}
/* host-test:end */

/* ===== Reply chips =====
 *
 * A notification may carry up to four short labels, and the knob picks one of
 * them. They are drawn in the band under the card, in place of the hint that
 * band shows for a message with nothing to pick.
 *
 * The whole row is ONE string with marks in it, the way the menu draws its
 * selection: a step then costs one padded draw_field over the MSG_HINT_W band,
 * with no fillRect and no display_force, instead of four fields plus the
 * inverse bars an inverse-bar selection would need. The padding is what erases
 * the previous row — it is at least as wide as the widest row that can be
 * built here, which is the property the ellipsising below guarantees and the
 * one tools/test_chips.sh pins.
 */
/* host-test:begin chips — sliced out by tools/test_chips.sh */
/* One chip's text once it has been fitted: a label and its terminator are
   NOTIFY_OPT_LEN already, and the ellipsis can add three characters on top of
   15 kept whole — 19 bytes at worst. The fourth byte is spare rather than
   counted out to nothing, since the room costs one byte per chip. */
#define UI_CHIP_LEN     (NOTIFY_OPT_LEN + 4)
/* The whole row: every chip carries two wrapper characters, one of them also
   carries the answered mark, and the row carries a terminator. */
#define UI_CHIP_ROW_LEN (NOTIFY_OPT_MAX * (UI_CHIP_LEN + 2) + 2)
/* Two marks rather than one, because they answer two different questions —
   what a click would do, and what a click already did. A message can be
   answered again, which puts both marks on the same chip. */
#define UI_CHIP_OPEN    '['
#define UI_CHIP_CLOSE   ']'
#define UI_CHIP_ANSWER  '*'

