Awis13/seed/seeds/esp32-tembed/src/ui.h
/* ===== The knob, on a card =====
 *
 * The body no longer fits the card, so the knob reads it. That leaves the
 * chips, which the knob used to walk, with no input of their own — and this is
 * where they get it back: the card is one axis, the body's lines first and the
 * chips under the last of them, exactly as they are drawn. Rolling past the end
 * of the text arrives on the reply row because on the panel that is where the
 * reply row is.
 *
 * Walking the stack of messages behind this one has moved off the knob and onto
 * a long press of the user key. It kept the knob for as long as a card was one
 * screenful; now that a card can be six, browsing and reading cannot share a
 * control.
 */
/* host-test:begin scroll — sliced out by tools/test_card.sh */
/* Where the knob is on a card: which body line is at the top of the band, and
   which chip is picked, or -1 for none. */
struct UiCardPos {
    int first;
    int chip;
};

/*
 * One turn of the knob on a card.
 *
 * It STOPS at both ends, and that is a deliberate exception to this device's
 * own rule that a knob has no end stops — the message list, the menu and the
 * brand list all wrap, and say so where they do it. The reason is that this one
 * is not a list: it is a paragraph. Of four shipped firmwares read for this
 * (Bruce, which ships a board file for this exact hardware, Meshtastic, Flipper
 * and EdgeTX) not one wraps scrolled text. Reading is not browsing, and landing
 * in the middle of the first sentence after the last line loses a reader's
 * place with no way to tell that it happened. Do not "fix" this into a wrap.
 *
 * The chips sit at the top of the axis rather than in a mode of their own, so
 * the invariant ui_chip_start() exists for survives a card that scrolls: a
 * message nobody deliberately read still has no chip selected when the click
 * arrives, because the only way onto the chips is to have turned the knob past
 * every line of the body. On a message short enough not to scroll that is one
 * detent, which is exactly what it was before this screen scrolled at all.
 *
 * The backlog is clamped before it is added rather than applied a step at a
 * time: ui_encoder_steps() returns the net detents since the last pass, and a
 * fast spin is one jump here, not one redraw per detent.
 */
static UiCardPos ui_card_step(UiCardPos pos, int steps, int max_first, int chips) {
    if (max_first < 0) max_first = 0;
    if (chips < 0) chips = 0;
    int span = max_first + chips;

    /* A guard rather than arithmetic any caller needs: it keeps the addition
       below in range for any int, whatever a spun encoder hands in. The clamp
       at the end of the axis gives the same answer without it, so no test
       claims it — tools/test_card.sh says so by name. */
    if (steps > span)  steps = span;
    if (steps < -span) steps = -span;

    /* Where the position given is on that axis. A chip index or a scroll
       position that the message no longer supports is clamped to its own end of
       the axis rather than allowed to spill across the join: a stale scroll
       position is a place in the text, and it must not arrive on a chip and put
       an answer under the next click. */
    int at;
    if (pos.chip >= 0 && chips > 0) {
        /* The clamp here is the same guard as the one on `steps`: the axis
           clamp below already brings a stale index back to the last chip, and
           this only keeps the addition in range on the way. */
        int c = (pos.chip < chips) ? pos.chip : chips - 1;
        at = max_first + 1 + c;
    } else {
        at = pos.first;
        if (at < 0) at = 0;
        if (at > max_first) at = max_first;
        /* A chip on a message that carries none is not a position at all; the
           bottom of the text is the nearest place it can mean. */
        if (pos.chip >= 0) at = max_first;
    }

    at += steps;
    if (at < 0) at = 0;
    if (at > span) at = span;

    UiCardPos out;
    if (at > max_first) {
        out.first = max_first;
        out.chip = at - max_first - 1;
    } else {
        out.first = at;
        out.chip = -1;
    }
    return out;
}

/*
 * The scrollbar's thumb, in pixels down the track.
 *
 * Meshtastic's geometry, kept as it stands there: a thumb and no track, a
 * minimum height so that a long body still leaves something to see, and — the
 * part worth copying rather than reinventing — a position normalised over
 * `track_h - thumb_h` instead of over the whole track. That is what puts the
 * bottom of the thumb flush with the bottom of the track at maximum scroll.
 * Flipper and EdgeTX normalise over the full track, and their thumbs either
 * overrun the end or stop short of it.
 */
static void ui_scroll_thumb(int first, int total, int visible, int track_h,
                            int *thumb_y, int *thumb_h) {
    /* The card asks for two lines or four and never for none, so this stands
       between nothing and the division below. Kept because "nothing calls it
       that way today" is not a reason for the arithmetic to be undefined when
       something does. */
    if (visible < 1) visible = 1;
    if (total < visible) total = visible;

    int h = (int)((long)track_h * visible / total);
    if (h < MSG_SCROLL_MIN_H) h = MSG_SCROLL_MIN_H;
    if (h > track_h) h = track_h;

    int max_scroll = total - visible;
    if (first < 0) first = 0;
    if (first > max_scroll) first = max_scroll;
    if (max_scroll < 1) max_scroll = 1;

    if (thumb_h) *thumb_h = h;
    if (thumb_y) *thumb_y = (int)((long)(track_h - h) * first / max_scroll);
}
/* host-test:end */

static uint16_t ui_level_color(uint8_t level) {
    switch (level) {
        case NOTIFY_CRIT: return COL_CRIT;
        case NOTIFY_WARN: return COL_ACCENT;
        default:          return COL_INFO;
    }
}

/* `MSG 03/12` in the header bar, black on amber, zero-padded so the field is
   the same width whatever it says. Shared by the list and the card, which are
   two views of one position in one queue. */
static void ui_draw_msg_counter(int pos, int total) {
    char buf[16];
    if (pos < 0) pos = 0;
    if (pos > 99) pos = 99;
    if (total < 0) total = 0;
    if (total > 99) total = 99;
    snprintf(buf, sizeof(buf), "MSG %02d/%02d", pos, total);
    draw_field(ui_row[UI_ROW_COUNT - 1], sizeof(ui_row[0]), buf,
               tft.width() - 8, HDR_Y, 2, COL_BG, TR_DATUM, 76, COL_ACCENT);
}

/* Shared scroll window: move it only when the selection would otherwise leave
   it, which keeps a step inside the window down to a two-row repaint. */
static void ui_window(int count, int rows) {
    if (ui_sel < ui_first) ui_first = ui_sel;
    if (ui_sel >= ui_first + rows) ui_first = ui_sel - rows + 1;
    if (ui_first > count - rows) ui_first = count - rows;
    if (ui_first < 0) ui_first = 0;
}

/* The three list screens differ only in what they list, so they share one
   renderer and one set of input rules. Both accessors read the live tables —
   the by-brand list is ir_codes[] itself, not a copy of the names. */
static int ui_list_count() {
    switch (ui_screen) {
        case UI_MENU:    return UI_ITEM_COUNT;
        case UI_TVMENU:  return UI_TV_COUNT;
        case UI_BRAND:   return ir_code_count + 1;  /* the codes, then Back */
        case UI_MSGLIST: return notify_count() + 1; /* the messages, then Back */
    }
    return 0;
}

static const char *ui_list_label(int i) {
    /* The Messages row carries its unread count and the Quiet row carries the
       window's hours, so those labels are built rather than looked up.
       ui_draw_list() consumes the return value into the row string before
       asking for the next one, so one shared buffer is enough. */
    static char built[24];

    switch (ui_screen) {
        case UI_MENU:
            if (i == UI_ITEM_MSG) {
                int unread = notify_unread_count();
                if (unread > 0) {
                    snprintf(built, sizeof(built), "Messages (%d) >", unread);
                    return built;
                }
            }
            if (i == UI_ITEM_QUIET) {
                /* "Quiet 00:00-08:00" or "Quiet off" — the row's name from the
                   table above, the window from the skill that owns it. The
                   longer of the two is 17 characters, which with the row's
                   marker measures 218px of font 4 against the 296px
                   ui_draw_row() has — measured against TFT_eSPI's own width
                   table, like every other column here, and pinned by
                   tools/test_quiet.sh at the hours' end. */
                char win[16];
                ring_quiet_hours(ring_night_from, ring_night_to, win, sizeof(win));
                snprintf(built, sizeof(built), "%s %s", ui_items[i], win);
                return built;
            }
            return ui_items[i];
        case UI_TVMENU: return ui_tv_items[i];
        case UI_BRAND:  return (i < ir_code_count) ? ir_codes[i].brand : "Back";
    }
    return "";
}

/* List: the marker is part of the string, so a moved selection changes the
   text of exactly two rows and only those two are repainted. A list longer
   than the panel scrolls a window over it, and the window moves only when the
   selection would otherwise leave it — which keeps the same two-row repaint
   for every step that stays inside it. */
static void ui_draw_list() {
    int count = ui_list_count();

