Awis13/seed/seeds/esp32-tembed/src/ui.h
    /* One pixel at the card's right edge, and only when there is something
       below the fold. It is drawn by hand rather than through draw_field
       because it is pixels and not a string, so it carries its own change test
       — like the progress bar on the clock face, and for the same reason. */
    if (ui_card_lines > rows) {
        int32_t track_y = body_y;
        /* Always the tall band, with no arm for the short one: a body with more
           lines than the band holds is a body that gave its title up for them,
           because ui_card_wrap() keeps the title only for a body that fits
           MSG_BODY_ROWS — and this branch is precisely the case where it does
           not. A `titled ? :` here would be a second layout that cannot occur. */
        int track_h = MSG_BODY_BOTTOM - MSG_BODY_DY_TOP + 1;
        int ty = 0, th = 0;
        ui_scroll_thumb(ui_card_first, ui_card_lines, rows, track_h, &ty, &th);
        if (display_force || ty != ui_card_thumb_y || th != ui_card_thumb_h) {
            tft.fillRect(x + MSG_SCROLL_DX, track_y, 1, track_h, tint);
            tft.fillRect(x + MSG_SCROLL_DX, track_y + ty, 1, th, c_sec);
            ui_card_thumb_y = ty;
            ui_card_thumb_h = th;
        }
    }

    /* Below the card, on the ground: what the knob does next. A message that
       carries reply options answers that with the options themselves, drawn in
       the accent so they read as the live control rather than as a caption —
       everything else on this screen is text about the message. Both go into
       the same field, and both are erased by the same padding. */
    if (v.opt_count > 0) {
        char chips[UI_CHIP_ROW_LEN];
        ui_chip_row(chips, sizeof(chips), v.options, v.opt_count,
                    ui_chip_sel, v.chosen, MSG_HINT_W, 2);
        draw_field(ui_card_hint, sizeof(ui_card_hint), chips,
                   tft.width() / 2, MSG_HINT_Y, 2, COL_ACCENT, TC_DATUM,
                   MSG_HINT_W);
    } else {
        draw_field(ui_card_hint, sizeof(ui_card_hint),
                   v.unread ? "CLICK TO ACK" : "CLICK TO GO BACK",
                   tft.width() / 2, MSG_HINT_Y, 2, COL_DIM, TC_DATUM,
                   MSG_HINT_W);
    }

    ui_draw_msg_counter(idx + 1, total);

    if (fading) ui_card_fade++;
    display_force = false;
}

static void ui_draw_blast() {
    IrProgress p = ir_progress();
    char buf[40];

    /* The job is staged the moment the menu item is clicked, but ir_poll()
       only adopts it — and resets the counters — on its next pass. Until then
       ir_state still describes the previous job, so say "starting" rather than
       paint a stale 27/27 over the first frame of this one. */
    bool starting = ir_busy() && !p.running;

    if (!ui_blast_ok) {
        ui_draw_row(0, "IR unavailable", 40, 4, COL_TIME);
        ui_draw_row(1, "", 78, 4, COL_DIM);
        ui_draw_row(2, "", 112, 2, COL_DIM);
    } else if (starting) {
        ui_draw_row(0, "starting", 40, 4, COL_TIME);
        ui_draw_row(1, "", 78, 4, COL_ACCENT);
        ui_draw_row(2, "", 112, 2, COL_DIM);
    } else if (p.running) {
        ui_draw_row(0, p.label[0] ? p.label : "starting", 40, 4, COL_TIME);
        /* p.sent, not p.step: the count on screen is frames the peripheral
           has actually finished clocking out. */
        snprintf(buf, sizeof(buf), "%d / %d", p.sent, p.total);
        ui_draw_row(1, buf, 78, 4, COL_ACCENT);
        snprintf(buf, sizeof(buf), "%lus elapsed", p.elapsed_ms / 1000);
        ui_draw_row(2, buf, 112, 2, COL_DIM);
    } else {
        snprintf(buf, sizeof(buf), "%s", p.result[0] ? p.result : "idle");
        ui_draw_row(0, buf, 40, 4, COL_TIME);
        snprintf(buf, sizeof(buf), "%d / %d sent", p.sent, p.total);
        ui_draw_row(1, buf, 78, 4, COL_DIM);
        ui_draw_row(2, "", 112, 2, COL_DIM);
    }
    ui_draw_row(3, (ui_blast_ok && ir_busy()) ? "click to stop" : "", 148, 2, COL_DIM);
    display_force = false;
}

static void ui_draw_ap() {
    char buf[40];

    if (!ap_active) {
        ui_draw_row(0, "AP failed to start", 40, 4, COL_TIME);
        ui_draw_row(1, "", 78, 4, COL_ACCENT);
        ui_draw_row(2, "", 118, 2, COL_DIM);
    } else {
        snprintf(buf, sizeof(buf), "SSID %s", ap_ssid.c_str());
        ui_draw_row(0, buf, 40, 4, COL_TIME);
        snprintf(buf, sizeof(buf), "PW   %s", ap_password.c_str());
        ui_draw_row(1, buf, 78, 4, COL_ACCENT);
        unsigned long mins = ap_minutes_left();
        if (mins > 0) snprintf(buf, sizeof(buf), "closes in %lu min", mins);
        else          snprintf(buf, sizeof(buf), "stays up until provisioned");
        ui_draw_row(2, buf, 118, 2, COL_DIM);
    }
    ui_draw_row(3, "click to go back", 148, 2, COL_DIM);
    display_force = false;
}

static void ui_draw_info() {
    char buf[40];
    int row = 0;
    const int32_t y0 = 26, dy = 18;

    /* The raw quadrature count rides along with the version because it is the
       only way to measure UI_COUNTS_PER_DETENT on a real board: turn the knob
       one click and read the difference. */
    snprintf(buf, sizeof(buf), "VER    %s   ENC %ld", SEED_VERSION,
             (long)ui_enc_raw);
    ui_draw_row(row, buf, y0 + dy * row, 2, COL_DIM); row++;

    if (WiFi.status() == WL_CONNECTED) {
        snprintf(buf, sizeof(buf), "IP     %s", WiFi.localIP().toString().c_str());
    } else if (ap_active) {
        snprintf(buf, sizeof(buf), "IP     %s (AP)", WiFi.softAPIP().toString().c_str());
    } else {
        snprintf(buf, sizeof(buf), "IP     offline");
    }
    ui_draw_row(row, buf, y0 + dy * row, 2, COL_DIM); row++;

    snprintf(buf, sizeof(buf), "MDNS   %s.local", mdns_name.c_str());
    ui_draw_row(row, buf, y0 + dy * row, 2, COL_DIM); row++;

    if (hw.has_battery && hw.battery_soc >= 0) {
        snprintf(buf, sizeof(buf), "BAT    %.2fV  %d%%", hw.battery_v, hw.battery_soc);
    } else if (hw.has_battery) {
        snprintf(buf, sizeof(buf), "BAT    %.2fV", hw.battery_v);
    } else {
        snprintf(buf, sizeof(buf), "BAT    no fuel gauge");
    }
    ui_draw_row(row, buf, y0 + dy * row, 2, COL_DIM); row++;

    if (WiFi.status() == WL_CONNECTED) {
        snprintf(buf, sizeof(buf), "RSSI   %d dBm", (int)WiFi.RSSI());
    } else {
        snprintf(buf, sizeof(buf), "RSSI   --");
    }
    ui_draw_row(row, buf, y0 + dy * row, 2, COL_DIM); row++;

