Awis13/seed/seeds/esp32-tembed/src/ui.h
/* The only place a screen changes, and the only place fillScreen is called
   outside display_status(). */
static void ui_enter(uint8_t screen) {
    ui_screen = screen;
    ui_last_input = millis();
    ui_last_draw = millis();
    ui_encoder_reset();

    /* Tell the ring what is on the panel, the same way loop() tells it which
       job is on the bar: the UI hands over a fact, and skills/ring.cpp decides
       on its own what to do with it.
       This is the only place a screen changes, which is exactly why the telling
       is here. Every way out of a card passes through it — the click that
       acknowledges the message, the user key, the idle timeout, the message
       expiring underneath the card — so the ring cannot be left naming a
       message nobody is looking at by a new exit path somebody forgets to
       update. The lookup can fail on a card whose message went away between the
       decision to show it and this line, and that is a card about to be closed
       on the next pass; the ring says nothing for it in the meantime.
       No host test covers these six lines and none can: they are a call into a
       driver from a function that draws. What IS covered is everything they
       feed — progress_ring_phase() by tools/test_progress.sh and the exclusion
       of the card's own message by tools/test_notify_options.sh — so the part
       left to inspection is that this sits in ui_enter() and nowhere else. */
    if (screen == UI_MSGCARD) {
        NotifyView v;
        if (notify_view_by_id(ui_msg_id, v, NULL, NULL)) ring_card_set(v.id, v.level);
        else ring_card_clear();
    } else {
        ring_card_clear();
    }

    if (screen == UI_CLOCK) {
        display_status();  /* repaints the clock chrome and every clock field */
        /* The link may have come or gone while the menu was up. This repaint
           already reflects it, so record it rather than let loop() spend a
           second fillScreen on the same news. */
        clock_last_status = WiFi.status();
        return;
    }

    tft.fillScreen(COL_BG);
    tft.setTextPadding(0);
    tft.setTextDatum(TL_DATUM);
    /* Inverse header bar: amber ground, black text, the way the Advisor's LCD
       did it. It replaces the hairline rule — the bar is its own separator —
       and it is what every screen under the knob has in common. The clock face
       keeps the plain header and the rule, because that face is the one thing
       here nobody asked to be louder. */
    tft.fillRect(0, 0, tft.width(), HDR_BAR_H, COL_ACCENT);
    tft.setTextColor(COL_BG, COL_ACCENT);
    tft.drawString(ui_titles[screen], 8, HDR_Y, 2);

    display_force = true;  /* the wipe took every cached field with it */
    ui_sel_drawn = -1;
    ui_first_drawn = -1;
    ui_draw();
}

/* Entering a list places the selection as well as the screen: ui_sel is shared
   by all three, so a brand index left over from one would be out of range in
   another. Callers use it to land on the item that leads back where they came
   from. */
static void ui_enter_list(uint8_t screen, int sel) {
    ui_sel = sel;
    ui_first = 0;
    ui_enter(screen);
}

/* Watch a job the list just asked for. `job` is 0 when nothing started, which
   is either a blast already in flight — watched rather than restarted — or a
   transmitter that is not there. */
static void ui_enter_blast(uint16_t job, int back_sel) {
    ui_blast_ok = (job != 0) || ir_busy();
    ui_blast_done_at = 0;
    ui_blast_back = ui_screen;
    ui_blast_back_sel = back_sel;
    if (job != 0) event_add("ir: job %u started from the menu", (unsigned)job);
    ui_enter(UI_BLAST);
}

/* Open one message. The card holds the id rather than the row, so that a
   message arriving or expiring while it is up cannot silently swap it for a
   different one. */
static void ui_enter_card(uint32_t id) {
    NotifyView v;

    ui_msg_id = id;
    ui_card_fade = 0;
    /* Where the knob starts is ui_chip_start()'s decision and only its, so that
       the host suite can hold it to account: an already-answered message opens
       on its own answer, so the click that leaves the card cannot quietly
       change it, and an unanswered one opens on nothing, so that same click
       stays the dismissal it has always been. notify_view_by_id() is the lookup
       ui_draw_card() draws with and stops at the same first id match, so the
       chip the knob starts on is the chip drawn starred. No entry to read is
       nothing to answer, which is the same nothing. */
    ui_chip_sel = notify_view_by_id(id, v, NULL, NULL)
                      ? ui_chip_start(v.chosen, v.opt_count)
                      : -1;
    /* A new card is a new body: drop the wrap, the scroll position and the
       thumb together, in the one place the card's identity changes. The fade
       that follows repaints the whole card, which is what erases the previous
       thumb from the panel — hence the drawn state going back to "nothing
       drawn" rather than to a position. */
    ui_card_wrapped = 0;
    ui_card_first = 0;
    ui_card_first_drawn = -1;
    ui_card_thumb_y = -1;
    ui_card_thumb_h = -1;
    ui_enter(UI_MSGCARD);
}

static void ui_activate(int item) {
    if (ui_screen == UI_MSGLIST) {
        int items = notify_count();
        if (item < items) {
            NotifyView v;
            if (notify_view(item, v)) ui_enter_card(v.id);
        } else {
            ui_enter_list(UI_MENU, UI_ITEM_MSG);
        }
        return;
    }

    if (ui_screen == UI_BRAND) {
        /* One named code, repeat 1 — which still means three frames for a Sony
           entry, because that is what SIRC needs. This is the point of the
           screen: the codes are power toggles, so blasting a set that holds
           several a television answers to turns it off, on and off again. */
        if (item < ir_code_count) ui_enter_blast(ir_start_code(item, 1), item);
        else ui_enter_list(UI_TVMENU, UI_TV_BRAND);
        return;
    }

    if (ui_screen == UI_TVMENU) {
        switch (item) {
            /* Repeat 1, the same default POST /ir/tvbgone applies to a
               body-less request. */
            case UI_TV_ALL: ui_enter_blast(ir_start_tvbgone(IR_REGION_ALL, 1), item); break;
            case UI_TV_NA:  ui_enter_blast(ir_start_tvbgone(IR_REGION_NA, 1), item);  break;
            case UI_TV_EU:  ui_enter_blast(ir_start_tvbgone(IR_REGION_EU, 1), item);  break;
            case UI_TV_BRAND: ui_enter_list(UI_BRAND, 0); break;
            default: ui_enter_list(UI_MENU, UI_ITEM_TVBGONE); break;
        }
        return;
    }

