Awis13/seed/seeds/esp32-tembed/src/ui.h
    switch (item) {
        case UI_ITEM_MSG:
            ui_enter_list(UI_MSGLIST, 0);
            break;
        case UI_ITEM_QUIET:
            /* The one row that acts without leaving the menu: the answer is the
               row's own label, which now says the other thing. A screen of its
               own would be a screen with one line on it.

               display_force, because ui_draw_list() returns early when the
               selection has not moved — and it has not: what changed is a
               string the cache still holds the old copy of. */
            ring_quiet_toggle();
            display_force = true;
            ui_draw();
            break;
        case UI_ITEM_TVBGONE:
            ui_enter_list(UI_TVMENU, UI_TV_ALL);
            break;
        case UI_ITEM_AP:
            /* The only route in on the device, and time-boxed: a session
               nobody reprovisions closes itself. It used to share the job with
               a three-second hold of the user key, which is now what walks the
               message stack — but this row was always the reliable one, and
               ap_start() has one more caller in wifi_setup(), which raises the
               AP at boot when the stored credentials do not connect. */
            if (!ap_active) ap_start(true);
            ui_enter(UI_AP);
            break;
        case UI_ITEM_INFO:
            ui_enter(UI_INFO);
            break;
        default:
            ui_enter(UI_CLOCK);
            break;
    }
}

/* One level up, landing on the item that leads back down. */
static void ui_back() {
    switch (ui_screen) {
        case UI_BRAND:   ui_enter_list(UI_TVMENU, UI_TV_BRAND);   break;
        case UI_TVMENU:  ui_enter_list(UI_MENU, UI_ITEM_TVBGONE); break;
        case UI_MSGLIST: ui_enter_list(UI_MENU, UI_ITEM_MSG);     break;
        default:         ui_enter(UI_CLOCK);                      break;
    }
}

static void ui_init() {
    /* GPIO0 is a strapping pin: it is only ever read, never driven. */
    pinMode(PIN_ENC_KEY, INPUT_PULLUP);
    /* Pull-ups before attaching: the library defaults to pull-DOWN, which
       leaves both channels floating against the encoder's common ground and
       makes the count wander with no error of any kind. */
    ESP32Encoder::useInternalWeakPullResistors = puType::up;
    /* Direction belongs to UI_ENCODER_DIRECTION, not to the pin order here. */
    ui_encoder.attachFullQuad(PIN_ENC_A, PIN_ENC_B);
    /* Hardware glitch filter, in APB (80MHz) cycles, 10 bits wide. attach()
       leaves it at 250 (~3.1us); 1023 is the register maximum and about
       12.8us, far below the shortest edge a hand can produce and well above
       contact bounce. The quadrature channels get this instead of a software
       time filter, which would drop real detents during a fast spin. */
    ui_encoder.setFilter(1023);
    ui_encoder.clearCount();
    ui_encoder_reset();
    ui_last_input = millis();
}

/* Called every loop() pass. Nothing here blocks and nothing here draws unless
   something actually changed. */
static void ui_poll() {
    int steps = ui_encoder_steps();
    ui_button_poll(ui_enc_key);
    ui_button_poll(ui_user_key);

    /* The encoder key's long hold belongs to the recording gesture in
       mic_key_poll(), so only a short press counts as a click here. Without
       this the release that ends a recording would ALSO open the menu from the
       clock, on top of stopping the take — the same trap the user key was
       already guarded against below, and for the same reason. */
    bool click = ui_enc_key.click && ui_enc_key.held_ms < MIC_HOLD_MS;
    /*
     * The user key's long hold walks the stack of messages behind the card,
     * which is the job the knob used to do before the knob became the way to
     * read a body longer than the card. It is a gesture on one screen only:
     * everywhere else a press of this key is "one level up" however long it
     * lasted, which is what it has always been, and confining the new meaning
     * to the card is what keeps a slow press on a menu from doing nothing at
     * all.
     *
     * The threshold is the one mic.cpp already uses for the encoder key's own
     * hold, so the device has one idea of how long a hold is rather than two.
     * It is not the three seconds the retired AP gesture used: that was long on
     * purpose, because it authorised provisioning, and walking a stack does not.
     *
     * `back` discards the release that ends the hold, the way it discarded the
     * one that ended the AP gesture — a hold produces a click on release like
     * any other press, and without this a long hold would both walk the stack
     * and leave the card.
     *
     * What `back` no longer does is throw away a slow press. It used to be
     * `click && held_ms < AP_KEY_HOLD_MS`, which meant a press of three seconds
     * or more did nothing at all on ANY screen: the filter was there to stop the
     * AP gesture's release from stepping up a level as well, and with the
     * gesture gone it protected nothing. So the device-wide consequence of that
     * one line is that a slow press is now one level up everywhere, which is
     * what this key means and what somebody leaning on it expects. The card is
     * the only screen that reads the length of a press at all, and it reads it
     * through `card_hold`.
     */
    bool card_hold = ui_user_key.click && ui_screen == UI_MSGCARD &&
                     ui_user_key.held_ms >= MSG_STACK_HOLD_MS;
    bool back = ui_user_key.click && !card_hold;

    /* The release of a press whose card went away underneath it. It is not a
       step up and it is not a walk of the stack: it is the end of a gesture
       whose subject no longer exists. See ui_drop_user_click. */
    if (ui_user_key.click && ui_drop_user_click) {
        ui_drop_user_click = false;
        card_hold = false;
        back = false;
    }

    /*
     * A key that is DOWN is input, and nothing above can see it: ui_button_poll()
     * reports a click on RELEASE only, so a press that has not been let go of
     * yet produces no steps, no click and no back at all. Two decisions below
     * turn on that — whether this pass belongs to somebody already touching the
     * device, and whether the device has been idle — and both were wrong for the
     * whole length of every hold without it.
     */
    bool key_down = ui_user_key.level || ui_enc_key.level;

